from django.db import models

# books = [
#     {'book_id': 1,
#      'book_title': 'Великий Гетсбі',
#      'book_description': 'Америка 20-го століття, джазове покоління.'
#                          ' Джей Гетсбі — багатій, що пройшов через тернистий шлях перш ніж досягти успіху.'
#                          ' Колись ніхто б на нього й не глянув, а зараз усі знають його як того самого Гетсбі,'
#                          ' котрий влаштовує найелітніші і найепатажніші вечірки. Джей Гетсбі зробив усе,'
#                          ' щоб добитись американської мрії, та отримав далеко не те на що очікував.'
#                          ' Роман автора було екранізовано у однойменному фільмі з Леонардо Ді Капріо у головній ролі.'
#                          ' Якщо ви ще не читали цю книгу — однозначно рекомендуємо. ',
#      'released_year': 1925,
#      'author': 1
#      },
#     {'book_id': 2,
#      'book_title': 'Портрет Доріана Грея',
#      'book_description': '«Портрет Доріана Ґрея» — вершина проповідуваного Оскаром Вайлдом естетизму і водночас'
#                          ' великої мистецької сили заперечення декадентських крайнощів цієї концепції;'
#                          ' це один із найпарадоксальніших романів модернізму. За словами самого письменника,'
#                          ' «справжня мораль цього твору полягає в тому, що всяке надуживання, так само,'
#                          ' як і самозречення, тягне за собою покару». Моральний злочин призводить до колапсу естетики.'
#                          ' Ще один і, можливо, найголовніший урок цього роману полягає в тому, що людина не може'
#                          ' надміру загравати ані з мистецтвом, ані з життям.',
#      'released_year': 1890,
#      'author': 3
#      },
#     {'book_id': 3,
#      'book_title': 'По той бік раю',
#      'book_description': 'Роман "По той бік раю" був опублікований 1920 року, і молодий письменник одразу'
#                          ' ж став знаменитим. У цьому творі висловлено емоційний досвід цілого покоління юних'
#                          ' американців, які прийшли в світ після Першої світової війни і, ставши дорослими, усвідомили,'
#                          ' що "всі боги вмерли, всі війни відгриміли, будь-яка віра підірвана".'
#                          ' Еморі Блейн має гарну зовнішність, чудову освіту, багатство. Він завжди жив у своє'
#                          ' задоволення й отримував усе, чого бажав. Однак смерть товариша, розорення,'
#                          ' неможливість через бідність одружитися з коханою дівчиною цілком змінюють його характер.'
#                          ' Чи знайде Еморі своє місце під сонцем після випробувань, які випали на його долю?..'
#                          ' Історія зайвої людини по-американськи. Роман про дорослішання... Про особистість...'
#                          ' Про трагедію "втраченого покоління..."',
#      'released_year': 1920,
#      'author': 1
#      },
#     {'book_id': 4,
#      'book_title': 'Атлант розправив плечі 1',
#      'book_description': 'Даґні Таґґарт керує найбільшою в країні залізницею і прагне впровадити нові технології,'
#                          ' щоб зробити свою бізнес-імперію ще сильнішою. У цьому їй допомагає Генк Ріарден – король'
#                          ' металургії, а ще нафтовий монополіст Елліс Ваятт, що перетворює Богом забуту землю на'
#                          ' промисловий рай. У їхніх руках — наймогутніші корпорації, що від них залежить доля країни. '
#                          'Вони — сучасні атланти. Їхня релігія — економіка, їхня відповідальність — тягар усього світу.'
#                          ' Колись вони мріяли змінити життя суспільства, а тепер їм доводиться чути, що вся їхня праця'
#                          ' лише помножує несправедливість. Що всім людям потрібні однакові права і можливості.'
#                          ' Спершу атланти лише знизували плечима.'
#                          ' Але настане той день, коли їм остаточно набридне тримати цей світ на своїх плечах…',
#      'released_year': 1957,
#      'author': 2
#      },
#     {'book_id': 5,
#      'book_title': 'Ніч лагідна',
#      'book_description': '«Ніч лагідна» — за визначенням критиків, один із кращих романів Ф. С. Фіцджеральда,'
#                          ' відомого американського письменника, філософа «джазової доби».'
#                          ' Тонке розуміння життєвого досвіду цілої генерації молодих американців,'
#                          ' народжених після Першої світової війни, що випали з контексту так званої'
#                          ' «американської мрії», глибина психологічного аналізу та лірико-емоційний самобутній стиль'
#                          ' ставлять цей роман Фіцджеральда поміж визначних явищ американської та'
#                          ' світової літератури минулого століття.',
#      'released_year': 1934,
#      'author': 1
#      },
#     {'book_id': 6,
#      'book_title': 'Атлант розправив плечі 2',
#      'book_description': "Друга частина трилогії «Атлант розправив плечі» розвінчує омани оптимістично налаштованих"
#                          " борців за рівність та братерство. Продовжується історія боротьби головних героїв"
#                          " Даґні Таґґарт та Генка Ріардена з нещадною державною системою, що вже почала руйнувати"
#                          " себе з середини… Політика державної влади призводить країну до економічного руйнування:"
#                          " суспільство занурюється в хаос, позбавлене провідників і цілей скочується у нове дикунство."
#                          " У свідомість мас наполегливо проштовхується уявлення про те, що мислення - це ілюзія,"
#                          " той, хто шукає будь-який сенс - просто втрачає час. Апофеозом цього процесу стає введення"
#                          " заборони на розум. Тим часом день за днем в країні зникають підприємці, вони відмовляються"
#                          " від здобутих досягнень і власними руками нищать справи свого життя, даючи зрозуміти,"
#                          " що встали у непримиренну опозицію до нової влади. Даґні починає підозрювати, що ці процеси"
#                          " не є збігом обставин, в країні з'явився невідомий Руйнівник, який свідомо усуває"
#                          " з економічного поля найвпливовіших гравців, прискорюючи тим самим загальну безпорадність"
#                          " і суспільну деградацію. Жінка не залишає надії запустити у виробництво досконалий двигун,"
#                          " йдучи на зустріч зі зневіреним інженером, що відмовився працювати на благо невігласів."
#                          " В дорозі вона знайомиться з випадковим волоцюгою. Виявляється, той колись працював в"
#                          " самому горнилі «чистого зла», що сьогодні пожирає всю країну...",
#      'released_year': 1957,
#      'author': 2
#      },
#     {'book_id': 7,
#      'book_title': 'Атлант розправив плечі 3',
#      'book_description': "Деструктивні тенденції у світі та суспільстві прискорюються у міру того, як великі"
#                          " промисловці і талановиті підприємці зникають з публічного життя. Даґні Таґґарт продовжує"
#                          " свої пошуки і, здається, впритул наближається до розкриття таємниці. Дедалі частіше вона"
#                          " чує ім’я загадкового Джона Ґолта, але чи він янгол-месник, а чи то створіння пекла,"
#                          " не в змозі сказати ніхто. Цілком зрозуміло, що ці двоє обов'язково перетнуться."
#                          " Загадкова ущелина Ґолта розкриває перед героїнею свій секрет: у її нетрях розкинувся"
#                          " цілий утопічний світ, де збіглі атланти намагаються будувати альтернативне суспільство"
#                          " на проголошених ними засадах особистісної реалізації. А ззовні світ продовжує занурюватися"
#                          " у хаос анархії та мародерства, державне регулювання всіх критично важливих галузей"
#                          " економіки сягає свого апогею ,що остаточно відштовхує від правлячої верхівки останніх"
#                          " лояльних представників бізнесової еліти.",
#      'released_year': 1957,
#      'author': 2
#      }
# ]
#
# authors = [
#     {'author': 1,
#      'first_name': 'Френсіс',
#      'last_name': 'Скотт Фіцджеральд',
#      'about_author': 'Відомому письменнику довелося пережити і злети, і падіння, що описано в його творах,'
#                      ' багато з яких автобіографічні. Він не був дуже популярний за життя, але після смерті купити'
#                      ' книги Френсіса Скотта Фіцджеральда стало модно і престижно. Сьогодні це визнаний класик'
#                      ' американської літератури, твори якого входять в її «золотий фонд». У нарисах, романах і'
#                      ' розповідях Френсіса Скотта Фіцджеральда оспівується галаслива, талановита, блискуча і'
#                      ' трагічна «епоха джазу». Цим терміном письменник позначив життя Америки 20-х років'
#                      'минулого століття, з її відчайдушністю, спрагою задоволень, удаваною веселощами і'
#                      ' внутрішнім надламом - тим, що було знайоме автору не з чуток.'
#      },
#     {'author': 2,
#      'first_name': 'Айн',
#      'last_name': 'Ренд',
#      'about_author': "Айн Ренд - американська письменниця і філософ, творець філософії об'єктивізму,"
#                      " дворазова володарка премії «Прометей». Народилася 2 лютого 1905 року в Санкт-Петербурзі."
#                      " Її справжнє ім'я Аліса Зіновіївна Розенбаум. Айн Ренд почала писати дуже рано, створюючи свій"
#                      " власний вигаданий світ, який був для неї більш цікавим, ніж світ навколишньої дійсності."
#                      " В 9 років вона зрозуміла, що в майбутньому мріє стати письменницею. У 1921 році дівчина вступила"
#                      " в Петроградський університет. Вона вивчала історію, філологію і право, а через три роки"
#                      " отримала диплом соціального педагога. У 1925 році була надрукована перша робота Аліси Розенбаум"
#                      " - «Пола Негрі», історія творчого шляху кіноактриси. У тому ж році дівчина отримала навчальну "
#                      "американську візу і поїхала в США. Критики високо оцінили вихід нового роману Айн Ренд «Джерело»,"
#                      " який она створювала цілих 4 роки. Книга неодноразово потрапляла до списку національних"
#                      " бестселерів. В 1957 році вона опублікувала свій головний роман - «Атлант розправив плечі»."
#                      " Над твором вона працювала 12 років.У книзі вона розповідає про свободу, егоїзм і лицемірство"
#                      " сучасного суспільства, про моральні цінності. Основна ідея роботи в тому, що світ тримається на"
#                      " талановитих одинаках, які змушені жити в суспільстві, схожому на соціалістичне."
#                      " Після виходу в світ «Атланта» Айн Ренд писала тільки книги публіцистичного змісту."
#                      " Залишок життя вона присвятила своєму філософському вченню."
#      },
#     {'author': 3,
#      'first_name': 'Вайлд',
#      'last_name': 'Оскар',
#      'about_author': 'Прославлений англійський та ірландський письменник, поет і філософ, автор творів, які давно'
#                      ' увійшли в золотий фонд нестаріючої світової класики і вивчаються в школах і університетах по'
#                      ' всьому світу. За мотивами їх сюжетів досі знімають фільми і створюють театральні постановки.'
#                      ' Купити книги Оскара Уайльда варто всім читачам, які бажають долучитися до визнаної класики'
#                      ' зарубіжної літератури. Яскраві особливості стилю письменника - точні, гострі характеристики і'
#                      ' велика кількість афоризмів. При цьому в романах, повістях і казках Оскар Уайльд піднімає'
#                      ' вічні теми, які не втратили актуальності навіть більш ніж через століття після їх написання.'
#      }
# ]


class Author(models.Model):
    first_name = models.CharField(max_length=50)
    last_name = models.CharField(max_length=50)
    about_author = models.TextField()

    # @staticmethod
    # def create_Author():
    #     for i in authors:
    #         author = Author(first_name=i['first_name'],
    #                         last_name=i['last_name'],
    #                         about_author=i['about_author'])
    #         author.save()

    def __str__(self):
        return f'{self.first_name} {self.last_name}'


class Book(models.Model):
    book_title = models.CharField(max_length=100)
    book_description = models.TextField()
    released_year = models.IntegerField()
    author = models.ForeignKey(Author, on_delete=models.CASCADE, blank=True, null=True)
    create_time = models.DateTimeField(auto_now_add=True)
    update_time = models.DateTimeField(auto_now=True)

    # @staticmethod
    # def create_Book():
    #     for i in books:
    #         author = Author.objects.get(id=i['author'])
    #         book = Book(book_title=i['book_title'],
    #                     book_description=i['book_description'],
    #                     released_year=i['released_year'],
    #                     author=author)
    #         book.save()

    def __str__(self):
        return self.book_title
